RAKWireless/RAK-STM32-RUI/boards.txt
WisDuoRAK3172TBoard.menu.supportEU433.1=On
WisDuoRAK3172TBoard.menu.supportEU433.1.build.regionEU433=-DREGION_EU433
WisDuoRAK3172TBoard.menu.supportEU433.2=Off
WisDuoRAK3172TBoard.menu.supportEU433.2.build.regionEU433= 

WisDuoRAK3172TBoard.menu.supportEU868.1=On
WisDuoRAK3172TBoard.menu.supportEU868.1.build.regionEU868=-DREGION_EU868
WisDuoRAK3172TBoard.menu.supportEU868.2=Off
WisDuoRAK3172TBoard.menu.supportEU868.2.build.regionEU868= 

WisDuoRAK3172TBoard.menu.supportKR920.1=On
WisDuoRAK3172TBoard.menu.supportKR920.1.build.regionKR920=-DREGION_KR920
WisDuoRAK3172TBoard.menu.supportKR920.2=Off
WisDuoRAK3172TBoard.menu.supportKR920.2.build.regionKR920= 

WisDuoRAK3172TBoard.menu.supportIN865.1=On
WisDuoRAK3172TBoard.menu.supportIN865.1.build.regionIN865=-DREGION_IN865
WisDuoRAK3172TBoard.menu.supportIN865.2=Off
WisDuoRAK3172TBoard.menu.supportIN865.2.build.regionIN865= 

WisDuoRAK3172TBoard.menu.supportUS915.1=On
WisDuoRAK3172TBoard.menu.supportUS915.1.build.regionUS915=-DREGION_US915
WisDuoRAK3172TBoard.menu.supportUS915.2=Off
WisDuoRAK3172TBoard.menu.supportUS915.2.build.regionUS915= 

WisDuoRAK3172TBoard.menu.supportRU864.1=On
WisDuoRAK3172TBoard.menu.supportRU864.1.build.regionRU864=-DREGION_RU864
WisDuoRAK3172TBoard.menu.supportRU864.2=Off
WisDuoRAK3172TBoard.menu.supportRU864.2.build.regionRU864= 

# ----------------------------------
# WisDuo RAK3272-SiP Board
# ----------------------------------
WisDuoRAK3272SiPBoard.name=WisDuo RAK3272-SiP Board
WisDuoRAK3272SiPBoard.bootloader.tool=bootburn
WisDuoRAK3272SiPBoard.build.variant_h=variant_{build.board}.h
WisDuoRAK3272SiPBoard.build.series=rak3172-sip

# Upload
WisDuoRAK3272SiPBoard.upload.tool=uploader_ymodem
WisDuoRAK3272SiPBoard.upload.protocol=uploader_ymodem
WisDuoRAK3272SiPBoard.upload.use_1200bps_touch=true
WisDuoRAK3272SiPBoard.upload.wait_for_upload_port=true
WisDuoRAK3272SiPBoard.upload.maximum_size=200704
WisDuoRAK3272SiPBoard.upload.maximum_data_size=48640

# Build
WisDuoRAK3272SiPBoard.build.mcu=cortex-m4
WisDuoRAK3272SiPBoard.build.f_cpu=64000000
WisDuoRAK3272SiPBoard.build.board=WisDuo_RAK3272-SiP_Board
WisDuoRAK3272SiPBoard.build.core=STM32WLE
WisDuoRAK3272SiPBoard.build.variant=WisDuo_RAK3272-SiP_Board
WisDuoRAK3272SiPBoard.build.usb_manufacturer="RAKwireless"
WisDuoRAK3272SiPBoard.build.usb_product="WisDuo RAK3272-SiP Board"
WisDuoRAK3272SiPBoard.build.extra_flags=-DSTM32WLE5xx -DRAK3272_SIP_VA -Drak3172_sip {build.flags.usb}
WisDuoRAK3272SiPBoard.build.flags.feature=-DLORA_IO_SPI_PORT=2 -DSYS_RTC_COUNTER_PORT=2 -DATCMD_CUST_TABLE_SIZE=64 -DWAN_TYPE=0 -DLORA_STACK_VER=0x040407 -Drak3172_sip -DCORE_CM4 -DUSE_HAL_DRIVER -DSTM32WLE5xx -DSOFT_SE -DSECURE_ELEMENT_PRE_PROVISIONED -DLORAMAC_CLASSB_ENABLED -DSUPPORT_SPI -DSUPPORT_AT -DRUI_SDK
WisDuoRAK3272SiPBoard.build.flags.lib_path="-L{runtime.platform.path}/cores/STM32WLE/app" "-L{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx" "-L{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal" "-L{runtime.platform.path}/cores/STM32WLE/external" "-L{runtime.platform.path}/cores/STM32WLE/component/core/board/{build.series}" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/serial" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/flash" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/timer" "-L{runtime.platform.path}/cores/STM32WLE/component/service/nvm" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/system" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/powersave" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/wdt" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/gpio" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/twimst" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/delay" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/rtc" "-L{runtime.platform.path}/cores/STM32WLE/component/service/lora" "-L{runtime.platform.path}/cores/STM32WLE/component/service/runtimeConfig" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/delay" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/gpio" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/rtc" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/twimst" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/dfu" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/pwm" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/crypto" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/trng" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/adc" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/pdm" "-L{runtime.platform.path}/cores/STM32WLE/component/udrv/spimst" "-L{runtime.platform.path}/cores/STM32WLE/component/service/battery" "-L{runtime.platform.path}/cores/STM32WLE/component/service/mode" "-L{runtime.platform.path}/cores/STM32WLE/component/service/debug" "-L{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api" "-L{runtime.platform.path}/cores/STM32WLE/component/fund/event_queue" "-L{runtime.platform.path}/cores/STM32WLE/component/fund/circular_queue" "-L{runtime.platform.path}/variants/{build.variant}" "-L{runtime.platform.path}/system/{build.variant}"
WisDuoRAK3272SiPBoard.build.flags.inc_path="-I{runtime.platform.path}/variants/{build.variant}" "-I{runtime.platform.path}/system/{build.variant}" "-I{runtime.platform.path}/cores/STM32WLE/app/RAK3272-SiP/src" "-I{runtime.platform.path}/cores/STM32WLE/component/inc" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/none/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/board/{build.series}" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/timer" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/delay" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/spimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/powersave" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/gpio" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/rtc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/twimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/dfu" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/crypto" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/trng" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/pwm" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/adc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/system" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/ble" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/flash" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/wdt" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/nfc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/pdm" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora/packages" "-I{runtime.platform.path}/cores/STM32WLE/component/service/runtimeConfig" "-I{runtime.platform.path}/cores/STM32WLE/component/service/nvm" "-I{runtime.platform.path}/cores/STM32WLE/component/service/battery" "-I{runtime.platform.path}/cores/STM32WLE/component/service/debug" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/cli" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/transparent" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/protocol" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api/avr" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/event_queue" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/circular_queue" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/system" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/apps/LoRaMac/common/LmHandler" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Device/ST/STM32WLxx/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/STM32WLxx_HAL_Driver/Inc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy/stm32_radio_driver" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/timer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/lpm/tiny_lpm" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/misc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/sequencer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/trace/adv_trace" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals/" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/queue" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/scheduler" "-I{runtime.platform.path}/cores/STM32WLE/external/FatFs/source" "-I{runtime.platform.path}/cores/STM32WLE/external/spiffs/src"
WisDuoRAK3272SiPBoard.build.flags.lib=
WisDuoRAK3272SiPBoard.build.flags.inc_path="-I{runtime.platform.path}/variants/{build.variant}" "-I{runtime.platform.path}/system/{build.variant}" "-I{runtime.platform.path}/cores/STM32WLE/app/RAK3272-SiP/src" "-I{runtime.platform.path}/cores/STM32WLE/component/inc" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/none/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/board/{build.series}" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/timer" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/delay" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/spimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/powersave" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/gpio" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/rtc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/twimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/dfu" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/crypto" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/trng" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/pwm" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/adc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/system" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/ble" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/flash" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/wdt" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/nfc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/pdm" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora/packages" "-I{runtime.platform.path}/cores/STM32WLE/component/service/runtimeConfig" "-I{runtime.platform.path}/cores/STM32WLE/component/service/nvm" "-I{runtime.platform.path}/cores/STM32WLE/component/service/battery" "-I{runtime.platform.path}/cores/STM32WLE/component/service/debug" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/cli" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/transparent" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/protocol" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api/avr" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/event_queue" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/circular_queue" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/system" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/apps/LoRaMac/common/LmHandler" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Device/ST/STM32WLxx/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/STM32WLxx_HAL_Driver/Inc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy/stm32_radio_driver" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/timer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/lpm/tiny_lpm" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/misc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/sequencer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/trace/adv_trace" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals/" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/queue" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/scheduler" "-I{runtime.platform.path}/cores/STM32WLE/external/FatFs/source" "-I{runtime.platform.path}/cores/STM32WLE/external/spiffs/src"
WisDuoRAK3272SiPBoard.build.ldscript=flash_stm32wle5xx.ld
WisDuoRAK3272SiPBoard.build.vid=0x1A86
WisDuoRAK3272SiPBoard.build.pid=0x7523

