RAKWireless/RAK-STM32-RUI/boards.txt
WisDuoRAK3272LPSiPBoard.build.flags.inc_path="-I{runtime.platform.path}/variants/{build.variant}" "-I{runtime.platform.path}/system/{build.variant}" "-I{runtime.platform.path}/cores/STM32WLE/app/RAK3272LP-SiP/src" "-I{runtime.platform.path}/cores/STM32WLE/component/inc" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/stm32wle5xx/uhal/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/core/mcu/none/uhal" "-I{runtime.platform.path}/cores/STM32WLE/component/core/board/rak3172-sip" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/serial" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/timer" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/delay" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/spimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/powersave" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/gpio" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/rtc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/twimst" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/dfu" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/crypto" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/trng" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/pwm" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/adc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/system" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/ble" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/flash" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/wdt" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/nfc" "-I{runtime.platform.path}/cores/STM32WLE/component/udrv/pdm" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora" "-I{runtime.platform.path}/cores/STM32WLE/component/service/lora/packages" "-I{runtime.platform.path}/cores/STM32WLE/component/service/runtimeConfig" "-I{runtime.platform.path}/cores/STM32WLE/component/service/nvm" "-I{runtime.platform.path}/cores/STM32WLE/component/service/battery" "-I{runtime.platform.path}/cores/STM32WLE/component/service/debug" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/cli" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/transparent" "-I{runtime.platform.path}/cores/STM32WLE/component/service/mode/protocol" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api" "-I{runtime.platform.path}/cores/STM32WLE/component/rui_v3_api/avr" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/event_queue" "-I{runtime.platform.path}/cores/STM32WLE/component/fund/circular_queue" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/system" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/apps/LoRaMac/common/LmHandler" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Device/ST/STM32WLxx/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/CMSIS/Include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Drivers/STM32WLxx_HAL_Driver/Inc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy/stm32_radio_driver" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Middlewares/Third_Party/SubGHz_Phy" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/timer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/lpm/tiny_lpm" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/misc" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/sequencer" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Utilities/trace/adv_trace" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/boards" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/mac/region" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/radio" "-I{runtime.platform.path}/cores/STM32WLE/external/lora/LoRaMac-node-4.4.7/src/peripherals/" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/queue" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/include" "-I{runtime.platform.path}/cores/STM32WLE/external/STM32CubeWL/Libraries/scheduler" "-I{runtime.platform.path}/cores/STM32WLE/external/FatFs/source" "-I{runtime.platform.path}/cores/STM32WLE/external/spiffs/src"
WisDuoRAK3272LPSiPBoard.build.ldscript=flash_stm32wle5xx.ld
WisDuoRAK3272LPSiPBoard.build.vid=0x1A86
WisDuoRAK3272LPSiPBoard.build.pid=0x7523

# Debug Menu
WisDuoRAK3272LPSiPBoard.menu.debug.l0=Level 0 (Release)
WisDuoRAK3272LPSiPBoard.menu.debug.l0.build.debug_flags=-DCFG_DEBUG=0
WisDuoRAK3272LPSiPBoard.menu.debug.l1=Level 1 (Error Message)
WisDuoRAK3272LPSiPBoard.debug.l1.build.debug_flags=-DCFG_DEBUG=1
WisDuoRAK3272LPSiPBoard.menu.debug.l2=Level 2 (Full Debug)
WisDuoRAK3272LPSiPBoard.menu.debug.l2.build.debug_flags=-DCFG_DEBUG=2
WisDuoRAK3272LPSiPBoard.menu.debug.l3=Level 3 (Segger SystemView)
WisDuoRAK3272LPSiPBoard.menu.debug.l3.build.debug_flags=-DCFG_DEBUG=3
WisDuoRAK3272LPSiPBoard.menu.debug.l3.build.sysview_flags=-DCFG_SYSVIEW=1

WisDuoRAK3272LPSiPBoard.menu.supportat.1=On
WisDuoRAK3272LPSiPBoard.menu.supportat.1.build.support_at_flag=-DSUPPORT_AT
WisDuoRAK3272LPSiPBoard.menu.supportat.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportat.2.build.support_at_flag=-USUPPORT_AT

WisDuoRAK3272LPSiPBoard.menu.supportlora.1=Support LoRaWAN and LoRa P2P
WisDuoRAK3272LPSiPBoard.menu.supportlora.1.build.supportlora=-DSUPPORT_LORA
WisDuoRAK3272LPSiPBoard.menu.supportlora.1.build.supportlora_p2p=-DSUPPORT_LORA_P2P
WisDuoRAK3272LPSiPBoard.menu.supportlora.2=Support LoRaWAN
WisDuoRAK3272LPSiPBoard.menu.supportlora.2.build.supportlora=-DSUPPORT_LORA
WisDuoRAK3272LPSiPBoard.menu.supportlora.2.build.supportlora_p2p=
WisDuoRAK3272LPSiPBoard.menu.supportlora.3=Support LoRa P2P
WisDuoRAK3272LPSiPBoard.menu.supportlora.3.build.supportlora=
WisDuoRAK3272LPSiPBoard.menu.supportlora.3.build.supportlora_p2p=-DSUPPORT_LORA_P2P
WisDuoRAK3272LPSiPBoard.menu.supportlora.4=Not Support
WisDuoRAK3272LPSiPBoard.menu.supportlora.4.build.supportlora=
WisDuoRAK3272LPSiPBoard.menu.supportlora.4.build.supportlora_p2p=

WisDuoRAK3272LPSiPBoard.menu.supportAS923.1=On
WisDuoRAK3272LPSiPBoard.menu.supportAS923.1.build.regionAS923=-DREGION_AS923
WisDuoRAK3272LPSiPBoard.menu.supportAS923.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportAS923.2.build.regionAS923= 

WisDuoRAK3272LPSiPBoard.menu.supportAU915.1=On
WisDuoRAK3272LPSiPBoard.menu.supportAU915.1.build.regionAU915=-DREGION_AU915
WisDuoRAK3272LPSiPBoard.menu.supportAU915.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportAU915.2.build.regionAU915= 

WisDuoRAK3272LPSiPBoard.menu.supportCN470.1=On
WisDuoRAK3272LPSiPBoard.menu.supportCN470.1.build.regionCN470=-DREGION_CN470
WisDuoRAK3272LPSiPBoard.menu.supportCN470.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportCN470.2.build.regionCN470= 

WisDuoRAK3272LPSiPBoard.menu.supportCN779.1=On
WisDuoRAK3272LPSiPBoard.menu.supportCN779.1.build.regionCN779=-DREGION_CN779
WisDuoRAK3272LPSiPBoard.menu.supportCN779.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportCN779.2.build.regionCN779= 

WisDuoRAK3272LPSiPBoard.menu.supportEU433.1=On
WisDuoRAK3272LPSiPBoard.menu.supportEU433.1.build.regionEU433=-DREGION_EU433
WisDuoRAK3272LPSiPBoard.menu.supportEU433.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportEU433.2.build.regionEU433= 

WisDuoRAK3272LPSiPBoard.menu.supportEU868.1=On
WisDuoRAK3272LPSiPBoard.menu.supportEU868.1.build.regionEU868=-DREGION_EU868
WisDuoRAK3272LPSiPBoard.menu.supportEU868.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportEU868.2.build.regionEU868= 

WisDuoRAK3272LPSiPBoard.menu.supportKR920.1=On
WisDuoRAK3272LPSiPBoard.menu.supportKR920.1.build.regionKR920=-DREGION_KR920
WisDuoRAK3272LPSiPBoard.menu.supportKR920.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportKR920.2.build.regionKR920= 

WisDuoRAK3272LPSiPBoard.menu.supportIN865.1=On
WisDuoRAK3272LPSiPBoard.menu.supportIN865.1.build.regionIN865=-DREGION_IN865
WisDuoRAK3272LPSiPBoard.menu.supportIN865.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportIN865.2.build.regionIN865= 

WisDuoRAK3272LPSiPBoard.menu.supportUS915.1=On
WisDuoRAK3272LPSiPBoard.menu.supportUS915.1.build.regionUS915=-DREGION_US915
WisDuoRAK3272LPSiPBoard.menu.supportUS915.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportUS915.2.build.regionUS915= 

WisDuoRAK3272LPSiPBoard.menu.supportRU864.1=On
WisDuoRAK3272LPSiPBoard.menu.supportRU864.1.build.regionRU864=-DREGION_RU864
WisDuoRAK3272LPSiPBoard.menu.supportRU864.2=Off
WisDuoRAK3272LPSiPBoard.menu.supportRU864.2.build.regionRU864= 
